<!-- terraform cdk action for options with hash ebfb9d8812ac663d88e2f19f90309ce5 -->
### ✅ Successfully planned Terraform CDK Stack 'demo'
          


<details><summary>Show Plan</summary>

```shell
demo  Initializing the backend...
demo  Successfully configured the backend "local"! Terraform will automatically
      use this backend unless the backend configuration changes.

      Initializing provider plugins...
      - Finding hashicorp/random versions matching "3.5.1"...
demo  - Installing hashicorp/random v3.5.1...
demo  - Installed hashicorp/random v3.5.1 (signed by HashiCorp)
demo  Terraform has created a lock file .terraform.lock.hcl to record the provider
      selections it made above. Include this file in your version control repository
      so that Terraform can guarantee to make the same selections by default when
      you run "terraform init" in the future.

      Terraform has been successfully initialized!

      You may now begin working with Terraform. Try running "terraform plan" to see
      any changes that are required for your infrastructure. All Terraform commands
      should now work.

      If you ever set or change modules or backend configuration for Terraform,
      rerun this command to reinitialize your working directory. If you forget, other
      commands will detect it and remind you to do so if necessary.
demo  - Fetching hashicorp/random 3.5.1 for linux_amd64...
demo  - Retrieved hashicorp/random 3.5.1 for linux_amd64 (signed by HashiCorp)
      - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
demo  Success! Terraform has validated the lock file and found no need for changes.
demo  Terraform used the selected providers to generate the following execution
      plan. Resource actions are indicated with the following symbols:
        + create
demo  Terraform will perform the following actions:

        # random_id.id (id) will be created
        + resource "random_id" "id" {
            + b64_std     = (known after apply)
            + b64_url     = (known after apply)
            + byte_length = 8
            + dec         = (known after apply)
            + hex         = (known after apply)
            + id          = (known after apply)
            + keepers     = {
                + "first" = (known after apply)
              }
          }

      Plan: 1 to add, 0 to change, 0 to destroy.

      ─────────────────────────────────────────────────────────────────────────────

      Saved the plan to: plan

      To perform exactly these actions, run the following command to apply:
          terraform apply "plan"


```

</details>